EulerTasks.org
#+title: Euler Tasks
#+STARTUP: latexpreview
* Preface
Hi!

I've done this small notebook with the help of Emacs Org mode, using Babel to create and run code cells, specifying ~:tangle~ option to send code to according source files.
Org mode has so much power!
It is really my main tool when it comes to literal programming, data-science and writing documentation.

This readme also automatically generated by Emacs, but it lacks syntax highlighting.
I invite you to open EulerTaks.html here in the repository in your browswer for a better view with highlightng.
And guess what? Html is also generated with Emacs!
Same stand for latex parts of the document.

This is my Project Euler problems solutions.
Mostly to solve them, I used Python, as it is my main language, and I work 90% of the time with it.
Python is good when implementing things to production, talk to various API's, and just to collect all the pieces in one puzzle.

But also I used R, I love R when it comes to some quick data discovery analysis.
It has so many useful tools without even importing a library.
It also has Purr, which is a nice /functional/ style library, which makes R more readable and declarative.
In general, I might say I like R more than Python since it is a bit close to functional languages.

[[Problem 8][Problem 8]] is solved with Haskell.
I'm quite new to Haskell, and got interested in it after got more familiar with R and Lisp.
I'm also running Xmonad as my window manager.

Finally, some problems, when it comes to turning somthing to string :), I've done with Emacs Lisp.

* Problem 1
[[https://projecteuler.net/problem=1][Link to the problem]]
If we list all the natural numbers below 10 that are multiples of 3 or 5, we get 3, 5, 6 and 9. The sum of these multiples is 23.

Find the sum of all the multiples of 3 or 5 below 1000.

Let's solve this with Python with a bit of feel of functional style.

#+begin_src python :results output :tangle problem1.py
def multiples(range_):
    return (x for x in range(range_) if x % 3 == 0
        or x % 5 == 0)


def sum_multiples(range_):
    return sum(multiples(range_))


print(sum_multiples(1000 + 1))
#+end_src

#+RESULTS:
: 234168

* Problem 2
[[https://projecteuler.net/problem=2][Link to the problem]]
Each new term in the Fibonacci sequence is generated by adding the previous two terms. By starting with 1 and 2, the first 10 terms will be:

#+begin_example
1, 2, 3, 5, 8, 13, 21, 34, 55, 89, ...
#+end_example

By considering the terms in the Fibonacci sequence whose values do not exceed four million, find the sum of the even-valued terms.

We can use a very basic Python while loop
#+begin_src python :results output :tangle problem2.py
we_are_looking = 4 * 10 ** 6 # 4 million

def find_fib_sum(number_of):
    first = 1
    second = 1
    last = 0
    sum_fibs = 0

    while last < number_of:
        last = (first + second)

        if last % 2 == 0: # find even
            sum_fibs += last

        first = int(second)
        second = int(last)

    return sum_fibs

print(find_fib_sum(we_are_looking))
#+end_src

#+RESULTS:
: 4613732

* Problem 5
[[https://projecteuler.net/problem=5][Link to the problem]]
2520 is the smallest number that can be divided by each of the numbers from 1 to 10 without any remainder.

What is the smallest positive number that is evenly divisible by all of the numbers from 1 to 20?

Basically, we need to find /lowest common multiplier/.
[[https://en.wikipedia.org/wiki/Euclidean_algorithm][We know]] that for three numbers:

\[ lcm(a, b, c) = lcm(a, lcm(b,c) \]

And in Python we can use gcd function from fractions, and reduce functional method:
#+begin_src python :results output :tangle problem5.py
from math import gcd
from functools import reduce

our_lcm = reduce(lambda a, b: int(a * b / gcd(a,b)), range(1, 21))

print(our_lcm)
#+end_src

#+RESULTS:
: 232792560

* Problem 6
[[https://projecteuler.net/problem=6][Link to the problem]]
The sum of the squares of the first ten natural numbers is,

k
\[ 1^{2} + 2^{2} + ... 10^{2} = 385\]

The square of the sum of the first ten natural numbers is,

\[(1+2+...+10)^2 = 55^2 = 3025\]

Hence the difference between the sum of the squares of the first ten natural numbers and the square of the sum is

\[ 3025 - 385 = 2640 \]

Find the difference between the sum of the squares of the first one hundred natural numbers and the square of the sum.


We can do that easily with R since it's /vectorized/.

#+begin_src R :results output :tangle problem6.R
f <- function(range){

  x = c(1:range)

  return(sum(x)^2 - sum(x^2))
}


y <- f(100)

print(y)
#+end_src

#+RESULTS:
: [1] 25164150

