EulerTasks.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-01-25 Wed 13:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Euler Tasks</title>
<meta name="author" content="Georgy" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Euler Tasks</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org5e95be4">1. Preface</a></li>
<li><a href="#orgbdfe69c">2. Problem 1</a></li>
<li><a href="#org50f2a36">3. Problem 2</a></li>
<li><a href="#orgd820692">4. Problem 5</a></li>
<li><a href="#orgb14eb9f">5. Problem 6</a></li>
<li><a href="#org88b85d4">6. Problem 7</a></li>
<li><a href="#org98b97ed">7. Problem 8</a></li>
<li><a href="#org1a1e686">8. Problem 13</a></li>
<li><a href="#orge7453c4">9. problem 25</a></li>
<li><a href="#org3f25f1f">10. Problem 31</a></li>
<li><a href="#orgfae505f">11. Problem 48</a></li>
</ul>
</div>
</div>
<div id="outline-container-org5e95be4" class="outline-2">
<h2 id="org5e95be4"><span class="section-number-2">1.</span> Preface</h2>
<div class="outline-text-2" id="text-1">
<p>
Hi!
</p>

<p>
I&rsquo;ve done this small notebook with the help of Emacs Org mode, using Babel to create and run code cells, specifying <code>:tangle</code> option to send code to according source files.
Org mode has so much power!
It is really my main tool when it comes to literal programming, data-science and writing documentation.
</p>

<p>
This readme also automatically generated by Emacs, but it lacks syntax highlighting.
I invite you to open EulerTaks.html here in the repository in your browswer for a better view with highlightng.
And guess what? Html is also generated with Emacs!
Same stand for latex parts of the document.
</p>

<p>
This is my Project Euler problems solutions.
Mostly to solve them, I used Python, as it is my main language, and I work 90% of the time with it.
Python is good when implementing things to production, talk to various API&rsquo;s, and just to collect all the pieces in one puzzle.
</p>

<p>
But also I used R, I love R when it comes to some quick data discovery analysis.
It has so many useful tools without even importing a library.
It also has Purr, which is a nice <i>functional</i> style library, which makes R more readable and declarative.
In general, I might say I like R more than Python since it is a bit close to functional languages.
</p>

<p>
<a href="#org98b97ed">Problem 8</a> is solved with Haskell.
I&rsquo;m quite new to Haskell, and got interested in it after got more familiar with R and Lisp.
I&rsquo;m also running Xmonad as my window manager.
</p>

<p>
Finally, some problems, when it comes to turning somthing to string :), I&rsquo;ve done with Emacs Lisp.
</p>
</div>
</div>

<div id="outline-container-orgbdfe69c" class="outline-2">
<h2 id="orgbdfe69c"><span class="section-number-2">2.</span> Problem 1</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="https://projecteuler.net/problem=1">Link to the problem</a>
If we list all the natural numbers below 10 that are multiples of 3 or 5, we get 3, 5, 6 and 9. The sum of these multiples is 23.
</p>

<p>
Find the sum of all the multiples of 3 or 5 below 1000.
</p>

<p>
Let&rsquo;s solve this with Python with a bit of feel of functional style.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #e67e80;">def</span> <span style="color: #a7c080;">multiples</span>(range_):
    <span style="color: #e67e80;">return</span> (x <span style="color: #e67e80;">for</span> x <span style="color: #e67e80;">in</span> <span style="color: #83c092;">range</span>(range_) <span style="color: #e67e80;">if</span> x % <span style="color: #d699b6;">3</span> == <span style="color: #d699b6;">0</span>
        <span style="color: #e67e80;">or</span> x % <span style="color: #d699b6;">5</span> == <span style="color: #d699b6;">0</span>)


<span style="color: #e67e80;">def</span> <span style="color: #a7c080;">sum_multiples</span>(range_):
    <span style="color: #e67e80;">return</span> <span style="color: #83c092;">sum</span>(multiples(range_))


<span style="color: #83c092;">print</span>(sum_multiples(<span style="color: #d699b6;">1000</span> + <span style="color: #d699b6;">1</span>))
</pre>
</div>
</div>
</div>

<div id="outline-container-org50f2a36" class="outline-2">
<h2 id="org50f2a36"><span class="section-number-2">3.</span> Problem 2</h2>
<div class="outline-text-2" id="text-3">
<p>
<a href="https://projecteuler.net/problem=2">Link to the problem</a>
Each new term in the Fibonacci sequence is generated by adding the previous two terms. By starting with 1 and 2, the first 10 terms will be:
</p>

<pre class="example" id="org18d92e6">
1, 2, 3, 5, 8, 13, 21, 34, 55, 89, ...
</pre>

<p>
By considering the terms in the Fibonacci sequence whose values do not exceed four million, find the sum of the even-valued terms.
</p>

<p>
We can use a very basic Python while loop
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #7fbbb3;">we_are_looking</span> = <span style="color: #d699b6;">4</span> * <span style="color: #d699b6;">10</span> ** <span style="color: #d699b6;">6</span> <span style="color: #859289; font-style: italic;"># </span><span style="color: #859289; font-style: italic;">4 million</span>

<span style="color: #e67e80;">def</span> <span style="color: #a7c080;">find_fib_sum</span>(number_of):
    <span style="color: #7fbbb3;">first</span> = <span style="color: #d699b6;">1</span>
    <span style="color: #7fbbb3;">second</span> = <span style="color: #d699b6;">1</span>
    <span style="color: #7fbbb3;">last</span> = <span style="color: #d699b6;">0</span>
    <span style="color: #7fbbb3;">sum_fibs</span> = <span style="color: #d699b6;">0</span>

    <span style="color: #e67e80;">while</span> last &lt; <span style="color: #7fbbb3;">number_of</span>:
        last = (first + second)

        <span style="color: #e67e80;">if</span> last % <span style="color: #d699b6;">2</span> == <span style="color: #d699b6;">0</span>: <span style="color: #859289; font-style: italic;"># </span><span style="color: #859289; font-style: italic;">find even</span>
            <span style="color: #7fbbb3;">sum_fibs</span> += last

        <span style="color: #7fbbb3;">first</span> = <span style="color: #83c092;">int</span>(second)
        <span style="color: #7fbbb3;">second</span> = <span style="color: #83c092;">int</span>(last)

    <span style="color: #e67e80;">return</span> sum_fibs

<span style="color: #83c092;">print</span>(find_fib_sum(we_are_looking))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd820692" class="outline-2">
<h2 id="orgd820692"><span class="section-number-2">4.</span> Problem 5</h2>
<div class="outline-text-2" id="text-4">
<p>
<a href="https://projecteuler.net/problem=5">Link to the problem</a>
2520 is the smallest number that can be divided by each of the numbers from 1 to 10 without any remainder.
</p>

<p>
What is the smallest positive number that is evenly divisible by all of the numbers from 1 to 20?
</p>

<p>
Basically, we need to find <i>lowest common multiplier</i>.
<a href="https://en.wikipedia.org/wiki/Euclidean_algorithm">We know</a> that for three numbers:
</p>

<p>
\[ lcm(a, b, c) = lcm(a, lcm(b,c) \]
</p>

<p>
And in Python we can use gcd function from fractions, and reduce functional method:
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #e67e80;">from</span> math <span style="color: #e67e80;">import</span> gcd
<span style="color: #e67e80;">from</span> functools <span style="color: #e67e80;">import</span> <span style="color: #83c092;">reduce</span>

<span style="color: #7fbbb3;">our_lcm</span> = <span style="color: #83c092;">reduce</span>(<span style="color: #e67e80;">lambda</span> a, b: <span style="color: #83c092;">int</span>(a * b / gcd(a,b)), <span style="color: #83c092;">range</span>(<span style="color: #d699b6;">1</span>, <span style="color: #d699b6;">21</span>))

<span style="color: #83c092;">print</span>(our_lcm)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb14eb9f" class="outline-2">
<h2 id="orgb14eb9f"><span class="section-number-2">5.</span> Problem 6</h2>
<div class="outline-text-2" id="text-5">
<p>
<a href="https://projecteuler.net/problem=6">Link to the problem</a>
The sum of the squares of the first ten natural numbers is,
</p>

<p>
k
\[ 1^{2} + 2^{2} + ... 10^{2} = 385\]
</p>

<p>
The square of the sum of the first ten natural numbers is,
</p>

<p>
\[(1+2+...+10)^2 = 55^2 = 3025\]
</p>

<p>
Hence the difference between the sum of the squares of the first ten natural numbers and the square of the sum is
</p>

<p>
\[ 3025 - 385 = 2640 \]
</p>

<p>
Find the difference between the sum of the squares of the first one hundred natural numbers and the square of the sum.
</p>


<p>
We can do that easily with R since it&rsquo;s <i>vectorized</i>.
</p>

<div class="org-src-container">
<pre class="src src-R"><span style="color: #a7c080;">f</span> <span style="color: #83c092;">&lt;-</span> <span style="color: #e67e80;">function</span>(range){

  x = c(<span style="color: #d699b6;">1</span>:range)

  <span style="color: #e67e80;">return</span>(sum(x)^<span style="color: #d699b6;">2</span> - sum(x^<span style="color: #d699b6;">2</span>))
}


y <span style="color: #83c092;">&lt;-</span> f(<span style="color: #d699b6;">100</span>)

print(y)
</pre>
</div>
</div>
</div>
