EulerTasks.org
* Problem 7
[[https://projecteuler.net/problem=7][Link to the problem]]

By listing the first six prime numbers: 2, 3, 5, 7, 11, and 13, we can see that the 6th prime is 13.

What is the 10 001st prime number?

#+begin_src python :results output :tangle problem7.py
def is_prime(n):
    if n < 2: pass
    for i in range(2, int(n**0.5) + 1):    # prime always less sqrt(n)
        if n % i == 0:
            return False
    return True


def prime(we_need):
    num_primes = 0
    p = 1

    while num_primes < we_need:
        p += 1
        if is_prime(p):
            num_primes += 1
    return p

we_need = 10001
print(prime(we_need))
#+end_src

#+RESULTS:
: 104743

* Problem 8
[[https://projecteuler.net/problem=8][Link to the problem]]
The four adjacent digits in the 1000-digit number that have the greatest product are 9 × 9 × 8 × 9 = 5832.

Find the thirteen adjacent digits in the 1000-digit number that have the greatest product. What is the value of this product?

I'm not that good in Haskell yet, don't judge :D

#+begin_src haskell :tangle problem8.hs
import Data.Char (digitToInt)
import Data.List (tails)

main :: IO()
main = print $ maximum products

series :: String
series =
  "73167176531330624919225119674426574742355349194934" <>
  "96983520312774506326239578318016984801869478851843" <>
  "85861560789112949495459501737958331952853208805511" <>
  "12540698747158523863050715693290963295227443043557" <>
  "66896648950445244523161731856403098711121722383113" <>
  "62229893423380308135336276614282806444486645238749" <>
  "30358907296290491560440772390713810515859307960866" <>
  "70172427121883998797908792274921901699720888093776" <>
  "65727333001053367881220235421809751254540594752243" <>
  "52584907711670556013604839586446706324415722155397" <>
  "53697817977846174064955149290862569321978468622482" <>
  "83972241375657056057490261407972968652414535100474" <>
  "82166370484403199890008895243450658541227588666881" <>
  "16427171479924442928230863465674813919123162824586" <>
  "17866458359124566529476545682848912883142607690042" <>
  "24219022671055626321111109370544217506941658960408" <>
  "07198403850962455444362981230987879927244284909188" <>
  "84580156166097919133875499200524063689912560717606" <>
  "05886116467109405077541002256983155200055935729725" <>
  "71636269561882670428252483600823257530420752963450"

products :: [Int]
products = do
  let number = map (fromIntegral . digitToInt) $ series
  map (product . take 13) (tails number)
#+end_src

#+begin_src shell
runghc problem8.hs
#+end_src

#+RESULTS:
: 23514624000

