EulerTasks.html

<div id="outline-container-org88b85d4" class="outline-2">
<h2 id="org88b85d4"><span class="section-number-2">6.</span> Problem 7</h2>
<div class="outline-text-2" id="text-6">
<p>
<a href="https://projecteuler.net/problem=7">Link to the problem</a>
</p>

<p>
By listing the first six prime numbers: 2, 3, 5, 7, 11, and 13, we can see that the 6th prime is 13.
</p>

<p>
What is the 10 001st prime number?
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #e67e80;">def</span> <span style="color: #a7c080;">is_prime</span>(n):
    <span style="color: #e67e80;">if</span> n &lt; <span style="color: #d699b6;">2</span>: <span style="color: #e67e80;">pass</span>
    <span style="color: #e67e80;">for</span> i <span style="color: #e67e80;">in</span> <span style="color: #83c092;">range</span>(<span style="color: #d699b6;">2</span>, <span style="color: #83c092;">int</span>(n**<span style="color: #d699b6;">0.5</span>) + <span style="color: #d699b6;">1</span>):    <span style="color: #859289; font-style: italic;"># </span><span style="color: #859289; font-style: italic;">prime always less sqrt(n)</span>
        <span style="color: #e67e80;">if</span> n % i == <span style="color: #d699b6;">0</span>:
            <span style="color: #e67e80;">return</span> <span style="color: #83c092;">False</span>
    <span style="color: #e67e80;">return</span> <span style="color: #83c092;">True</span>


<span style="color: #e67e80;">def</span> <span style="color: #a7c080;">prime</span>(we_need):
    num_primes = <span style="color: #d699b6;">0</span>
    p = <span style="color: #d699b6;">1</span>

    <span style="color: #e67e80;">while</span> num_primes &lt; we_need:
        p += <span style="color: #d699b6;">1</span>
        <span style="color: #e67e80;">if</span> is_prime(p):
            num_primes += <span style="color: #d699b6;">1</span>
    <span style="color: #e67e80;">return</span> p

we_need = <span style="color: #d699b6;">10001</span>
<span style="color: #83c092;">print</span>(prime(we_need))
</pre>
</div>
</div>
</div>

<div id="outline-container-org98b97ed" class="outline-2">
<h2 id="org98b97ed"><span class="section-number-2">7.</span> Problem 8</h2>
<div class="outline-text-2" id="text-7">
<p>
<a href="https://projecteuler.net/problem=8">Link to the problem</a>
The four adjacent digits in the 1000-digit number that have the greatest product are 9 × 9 × 8 × 9 = 5832.
</p>

<p>
Find the thirteen adjacent digits in the 1000-digit number that have the greatest product. What is the value of this product?
</p>

<p>
I&rsquo;m not that good in Haskell yet, don&rsquo;t judge :D
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #e67e80;">import</span> <span style="color: #a7c080;">Data.Char</span> (digitToInt)
<span style="color: #e67e80;">import</span> <span style="color: #a7c080;">Data.List</span> (tails)

<span style="color: #a7c080;">main</span> <span style="color: #7fbbb3;">::</span> <span style="color: #a7c080;">IO</span><span style="color: #a7c080;">()</span>
<span style="color: #a7c080;">main</span> <span style="color: #7fbbb3;">=</span> print <span style="color: #7fbbb3;">$</span> maximum products

<span style="color: #a7c080;">series</span> <span style="color: #7fbbb3;">::</span> <span style="color: #a7c080;">String</span>
<span style="color: #a7c080;">series</span> <span style="color: #7fbbb3;">=</span>
  <span style="color: #a7c080;">"73167176531330624919225119674426574742355349194934"</span> <span style="color: #7fbbb3;">&lt;&gt;</span>
  <span style="color: #a7c080;">"96983520312774506326239578318016984801869478851843"</span> <span style="color: #7fbbb3;">&lt;&gt;</span>
  <span style="color: #a7c080;">"85861560789112949495459501737958331952853208805511"</span> <span style="color: #7fbbb3;">&lt;&gt;</span>
  <span style="color: #a7c080;">"12540698747158523863050715693290963295227443043557"</span> <span style="color: #7fbbb3;">&lt;&gt;</span>
  <span style="color: #a7c080;">"66896648950445244523161731856403098711121722383113"</span> <span style="color: #7fbbb3;">&lt;&gt;</span>
  <span style="color: #a7c080;">"62229893423380308135336276614282806444486645238749"</span> <span style="color: #7fbbb3;">&lt;&gt;</span>
  <span style="color: #a7c080;">"30358907296290491560440772390713810515859307960866"</span> <span style="color: #7fbbb3;">&lt;&gt;</span>
  <span style="color: #a7c080;">"70172427121883998797908792274921901699720888093776"</span> <span style="color: #7fbbb3;">&lt;&gt;</span>
  <span style="color: #a7c080;">"65727333001053367881220235421809751254540594752243"</span> <span style="color: #7fbbb3;">&lt;&gt;</span>
  <span style="color: #a7c080;">"52584907711670556013604839586446706324415722155397"</span> <span style="color: #7fbbb3;">&lt;&gt;</span>
  <span style="color: #a7c080;">"53697817977846174064955149290862569321978468622482"</span> <span style="color: #7fbbb3;">&lt;&gt;</span>
  <span style="color: #a7c080;">"83972241375657056057490261407972968652414535100474"</span> <span style="color: #7fbbb3;">&lt;&gt;</span>
  <span style="color: #a7c080;">"82166370484403199890008895243450658541227588666881"</span> <span style="color: #7fbbb3;">&lt;&gt;</span>
  <span style="color: #a7c080;">"16427171479924442928230863465674813919123162824586"</span> <span style="color: #7fbbb3;">&lt;&gt;</span>
  <span style="color: #a7c080;">"17866458359124566529476545682848912883142607690042"</span> <span style="color: #7fbbb3;">&lt;&gt;</span>
  <span style="color: #a7c080;">"24219022671055626321111109370544217506941658960408"</span> <span style="color: #7fbbb3;">&lt;&gt;</span>
  <span style="color: #a7c080;">"07198403850962455444362981230987879927244284909188"</span> <span style="color: #7fbbb3;">&lt;&gt;</span>
  <span style="color: #a7c080;">"84580156166097919133875499200524063689912560717606"</span> <span style="color: #7fbbb3;">&lt;&gt;</span>
  <span style="color: #a7c080;">"05886116467109405077541002256983155200055935729725"</span> <span style="color: #7fbbb3;">&lt;&gt;</span>
  <span style="color: #a7c080;">"71636269561882670428252483600823257530420752963450"</span>

<span style="color: #a7c080;">products</span> <span style="color: #7fbbb3;">::</span> [<span style="color: #a7c080;">Int</span>]
<span style="color: #a7c080;">products</span> <span style="color: #7fbbb3;">=</span> <span style="color: #e67e80;">do</span>
  <span style="color: #e67e80;">let</span> number <span style="color: #7fbbb3;">=</span> map (fromIntegral <span style="color: #7fbbb3;">.</span> digitToInt) <span style="color: #7fbbb3;">$</span> series
  map (product <span style="color: #7fbbb3;">.</span> take <span style="color: #d699b6;">13</span>) (tails number)
</pre>
</div>

<div class="org-src-container">
<pre class="src src-shell">runghc problem8.hs
</pre>
</div>
</div>
</div>
