EulerTasks.org
* problem 25
[[https://projecteuler.net/problem=25][Link to the problem]]
The Fibonacci sequence is defined by the recurrence relation:

\[F_n = F_n−1 + F_n−2, \text{where } F_1 = 1 \text{ and } F_2 = 1\]

Hence the first 12 terms will be:

\[F_1 = 1\]
\[F_2 = 1\]
\[F_3 = 2\]
\[F_4 = 3\]
\[F_5 = 5\]
\[F_6 = 8\]
\[F_7 = 13\]
\[F_8 = 21\]
\[F_9 = 34\]
\[F_10 = 55\]
\[F_11 = 89\]
\[F_12 = 144\]

The 12th term, F12, is the first term to contain three digits.

What is the index of the first term in the Fibonacci sequence to contain 1000 digits?

Well, since we already dealt with Fibonacci in [[Problem 2][Problem 2]], this should not be too hard to do with Python:
it will exceed the limit for printing the integer though.

#+begin_src python :results output :tangle problem25.py
fib = [0, 1]

iter_ = 2

#loop breaks when the number is 1000 digits long
while True:
    fib_new = fib[iter_ - 1] + fib[iter_ - 2]
    fib.append(fib_new)
    if fib_new > 10 ** 999:
        print(iter_)
        break
    iter_ += 1

#+end_src

#+RESULTS:
: 4782

* Problem 31
[[https://projecteuler.net/problem=31][Link to the problem]]

In the United Kingdom the currency is made up of pound (£) and pence (p). There are eight coins in general circulation:

#+begin_example
1p, 2p, 5p, 10p, 20p, 50p, £1 (100p), and £2 (200p).
#+end_example

It is possible to make £2 in the following way:

#+begin_example
1×£1 + 1×50p + 2×20p + 1×5p + 1×2p + 3×1p
#+end_example

How many different ways can £2 be made using any number of coins?

This is where we can use simple /recursion/ in R:

#+begin_src R :results output :tangle problem31.R
my.coins <- c(1,2,5,10,20,50,100,200)
my.coins.num <- length(my.coins)
my.money <- 200


find.change <- function(money, num.coins) {
    s <- 0
    range <- c(1:num.coins)

    for ( i in range ) {
        remaining <- money-my.coins[i]

        if( remaining == 0 )
            s <- s + 1

        if(remaining > 0)
            s <- s + find.change( remaining, i )
    }
    return(s)
}

my.change <- find.change(my.money, my.coins.num )

print(my.change)
#+end_src

#+RESULTS:
: [1] 73682

* Problem 48
[[https://projecteuler.net/problem=48][Link to the problem]]
The series, \[1^1 + 2^2 + 3^3 + ... + 10^{10} = 10405071317\]

Find the last ten digits of the series, \[1^1 + 2^2 + 3^3 + ... + 1000^{1000}\]

This looks pretty similar to [[Problem 13][Problem 13]], so why not to use Lisp again for its string abilities?
I have faced with ~max-lisp-eval-depth~ error though, so we'll increase it, as well as ~max-specpdl-size.~

#+begin_src emacs-lisp :tangle problem48.el
(setq max-lisp-eval-depth 10000)
(setq max-specpdl-size 10000)

(defun self-power-sum (x)
	(if (= x 0) 0
	(+ (expt x x) (self-power-series (- x 1)))))

(setq mylist
  (list(self-power-sum 1000)))

(message(substring (format "%s" mylist) -11 -1))
#+end_src

#+RESULTS:
: 9110846700
