EulerTasks.html

<div id="outline-container-orge7453c4" class="outline-2">
<h2 id="orge7453c4"><span class="section-number-2">9.</span> problem 25</h2>
<div class="outline-text-2" id="text-9">
<p>
<a href="https://projecteuler.net/problem=25">Link to the problem</a>
The Fibonacci sequence is defined by the recurrence relation:
</p>

<p>
\[F_n = F_n−1 + F_n−2, \text{where } F_1 = 1 \text{ and } F_2 = 1\]
</p>

<p>
Hence the first 12 terms will be:
</p>

<p>
\[F_1 = 1\]
\[F_2 = 1\]
\[F_3 = 2\]
\[F_4 = 3\]
\[F_5 = 5\]
\[F_6 = 8\]
\[F_7 = 13\]
\[F_8 = 21\]
\[F_9 = 34\]
\[F_10 = 55\]
\[F_11 = 89\]
\[F_12 = 144\]
</p>

<p>
The 12th term, F12, is the first term to contain three digits.
</p>

<p>
What is the index of the first term in the Fibonacci sequence to contain 1000 digits?
</p>

<p>
Well, since we already dealt with Fibonacci in <a href="#org50f2a36">Problem 2</a>, this should not be too hard to do with Python:
it will exceed the limit for printing the integer though.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #7fbbb3;">fib</span> = [<span style="color: #d699b6;">0</span>, <span style="color: #d699b6;">1</span>]

<span style="color: #7fbbb3;">iter_</span> = <span style="color: #d699b6;">2</span>

<span style="color: #859289; font-style: italic;">#</span><span style="color: #859289; font-style: italic;">loop breaks when the number is 1000 digits long</span>
<span style="color: #e67e80;">while</span> <span style="color: #83c092;">True</span>:
    fib_new = fib[iter_ - <span style="color: #d699b6;">1</span>] + fib[iter_ - <span style="color: #d699b6;">2</span>]
    fib.append(fib_new)
    <span style="color: #e67e80;">if</span> fib_new &gt; <span style="color: #d699b6;">10</span> ** <span style="color: #d699b6;">999</span>:
        <span style="color: #83c092;">print</span>(iter_)
        <span style="color: #e67e80;">break</span>
    <span style="color: #7fbbb3;">iter_</span> += <span style="color: #d699b6;">1</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org3f25f1f" class="outline-2">
<h2 id="org3f25f1f"><span class="section-number-2">10.</span> Problem 31</h2>
<div class="outline-text-2" id="text-10">
<p>
<a href="https://projecteuler.net/problem=31">Link to the problem</a>
</p>

<p>
In the United Kingdom the currency is made up of pound (£) and pence (p). There are eight coins in general circulation:
</p>

<pre class="example" id="orgd93c824">
1p, 2p, 5p, 10p, 20p, 50p, £1 (100p), and £2 (200p).
</pre>

<p>
It is possible to make £2 in the following way:
</p>

<pre class="example" id="orgfedf76e">
1×£1 + 1×50p + 2×20p + 1×5p + 1×2p + 3×1p
</pre>

<p>
How many different ways can £2 be made using any number of coins?
</p>

<p>
This is where we can use simple <i>recursion</i> in R:
</p>

<div class="org-src-container">
<pre class="src src-R">my.coins <span style="color: #83c092;">&lt;-</span> c(<span style="color: #d699b6;">1</span>,<span style="color: #d699b6;">2</span>,<span style="color: #d699b6;">5</span>,<span style="color: #d699b6;">10</span>,<span style="color: #d699b6;">20</span>,<span style="color: #d699b6;">50</span>,<span style="color: #d699b6;">100</span>,<span style="color: #d699b6;">200</span>)
my.coins.num <span style="color: #83c092;">&lt;-</span> length(my.coins)
my.money <span style="color: #83c092;">&lt;-</span> <span style="color: #d699b6;">200</span>


<span style="color: #a7c080;">find.change</span> <span style="color: #83c092;">&lt;-</span> <span style="color: #e67e80;">function</span>(money, num.coins) {
    s <span style="color: #83c092;">&lt;-</span> <span style="color: #d699b6;">0</span>
    range <span style="color: #83c092;">&lt;-</span> c(<span style="color: #d699b6;">1</span>:num.coins)

    <span style="color: #e67e80;">for</span> ( i <span style="color: #e67e80;">in</span> range ) {
        remaining <span style="color: #83c092;">&lt;-</span> money-my.coins[i]

        <span style="color: #e67e80;">if</span>( remaining == <span style="color: #d699b6;">0</span> )
            s <span style="color: #83c092;">&lt;-</span> s + <span style="color: #d699b6;">1</span>

        <span style="color: #e67e80;">if</span>(remaining &gt; <span style="color: #d699b6;">0</span>)
            s <span style="color: #83c092;">&lt;-</span> s + find.change( remaining, i )
    }
    <span style="color: #e67e80;">return</span>(s)
}

my.change <span style="color: #83c092;">&lt;-</span> find.change(my.money, my.coins.num )

print(my.change)
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfae505f" class="outline-2">
<h2 id="orgfae505f"><span class="section-number-2">11.</span> Problem 48</h2>
<div class="outline-text-2" id="text-11">
<p>
<a href="https://projecteuler.net/problem=48">Link to the problem</a>
The series, \[1^1 + 2^2 + 3^3 + ... + 10^{10} = 10405071317\]
</p>

<p>
Find the last ten digits of the series, \[1^1 + 2^2 + 3^3 + ... + 1000^{1000}\]
</p>

<p>
This looks pretty similar to <a href="#org1a1e686">Problem 13</a>, so why not to use Lisp again for its string abilities?
I have faced with <code>max-lisp-eval-depth</code> error though, so we&rsquo;ll increase it, as well as <code>max-specpdl-size.</code>
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #a7c080;">(</span><span style="color: #e67e80;">setq</span> <span style="color: #7fbbb3;">max-lisp-eval-depth</span> <span style="color: #d699b6;">10000</span><span style="color: #a7c080;">)</span>
<span style="color: #a7c080;">(</span><span style="color: #e67e80;">setq</span> <span style="color: #7fbbb3;">max-specpdl-size</span> <span style="color: #d699b6;">10000</span><span style="color: #a7c080;">)</span>

<span style="color: #a7c080;">(</span><span style="color: #e67e80;">defun</span> <span style="color: #a7c080;">self-power-sum</span> <span style="color: #e67e80;">(</span>x<span style="color: #e67e80;">)</span>
        <span style="color: #e67e80;">(</span><span style="color: #e67e80;">if</span> <span style="color: #7fbbb3;">(</span><span style="color: #83c092;">=</span> x <span style="color: #d699b6;">0</span><span style="color: #7fbbb3;">)</span> <span style="color: #d699b6;">0</span>
        <span style="color: #7fbbb3;">(</span><span style="color: #83c092;">+</span> <span style="color: #83c092;">(</span><span style="color: #83c092;">expt</span> x x<span style="color: #83c092;">)</span> <span style="color: #83c092;">(</span>self-power-series <span style="color: #a7c080;">(</span><span style="color: #83c092;">-</span> x <span style="color: #d699b6;">1</span><span style="color: #a7c080;">)</span><span style="color: #83c092;">)</span><span style="color: #7fbbb3;">)</span><span style="color: #e67e80;">)</span><span style="color: #a7c080;">)</span>

<span style="color: #a7c080;">(</span><span style="color: #e67e80;">setq</span> mylist
  <span style="color: #e67e80;">(</span><span style="color: #83c092;">list</span><span style="color: #7fbbb3;">(</span>self-power-sum <span style="color: #d699b6;">1000</span><span style="color: #7fbbb3;">)</span><span style="color: #e67e80;">)</span><span style="color: #a7c080;">)</span>

<span style="color: #a7c080;">(</span><span style="color: #83c092;">message</span><span style="color: #e67e80;">(</span><span style="color: #83c092;">substring</span> <span style="color: #7fbbb3;">(</span><span style="color: #83c092;">format</span> <span style="color: #a7c080;">"%s"</span> mylist<span style="color: #7fbbb3;">)</span> <span style="color: #d699b6;">-11</span> <span style="color: #d699b6;">-1</span><span style="color: #e67e80;">)</span><span style="color: #a7c080;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Georgy</p>
<p class="date">Created: 2023-01-25 Wed 13:47</p>
</div>
</body>
</html>